using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _09_Tree
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
            트리란?
            자료 간의 관계가 계층 구조일 때 사용하는 비선형자료구조이다.

            노드로 이루어진 자료구조.
            트리는 하나의 루트 노드를 가진다.
            루트 노드는 0개 이상의 자식 노드를 갖고 있다.
            
            루트 노드 : 최상단 노드
            리프 노드 : 말단 노드

            노드의 크기 : 자신을 포함한 모든 자식 노드의 갯수
            노드의 깊이 : 루트노드에서 특정 노드에 도달하기 위해 거쳐야 하는 간선의 수
            노드의 레벨 : 특정 노드의 깊이
            노드의 차수 : 각 노드가 지닌 하위 가지의 수

            트리의 차수 : 트리의 최대 차수
            트리의 높이 : 노트 노드에서 가장 깊숙히 있는 노드의 깊이

            노드가 N개인 트리는 항상 N-1개의 간선을 가진다.
            트리의 종류로는 이진 트리, 이진 탐색 트리, 균형 트리, 이진 힙 등이 있다...

            * 이진 트리
            루트가 있는 트리 구조에서 어떤 노드의 자식의 수가 최대 2개를 넘지 않는 트리를 말한다.
            완전 트리는 왼쪽부터 꽉 채워져 있는 구조 (중간에 공백이 있으면 완전 트리가 아니다.)

            * 이진 트리의 순회
            1. 전위 순회 VLR
            2. 후위 순회 LRV
            3. 중위 순회 LVR

             */
        }
    }
}
